"use client";
import React, { useState, useEffect } from "react";
import Link from "next/link";

const Page = () => {
  const [poems, setPoems] = useState(null);
  const [oldPoems, setOldPoems] = useState([
    {
      _id: "673ca68b9b3b66ac7d33ec98",
      title: "Singha di Mehma",
      body: "ਸਿੰਘਾਂ ਦੇ ਡੋਲੇ ਫੜ੍ਹਕਦੇ ਹੀ ਰਹਿਣਗੇ\nਸਿੰਘਾਂ ਦੇ ਖੰਡੇ ਖੜਕਦੇ ਹੀ ਰਹਿਣਗੇ\nਕਲਾ ਸਿੰਘਾਂ ਦੀ ਚੜ੍ਹਦੀ ਹੀ ਰਹੇਗੀ\nਲੋਕਾਈ ਵੀ ਸੋਹਲੇ ਪੜ੍ਹਦੀ ਹੀ ਰਹੇਗੀ\nਬੁੰਗੇ ਵੀ ਜੁਗਾਂ ਤਾਈਂ ਸਜਦੇ ਹੀ ਰਹਿਣਗੇ \nਰਣਜੀਤ ਨਗਾਰੇ ਵੀ ਵੱਜਦੇ ਹੀ ਰਹਿਣਗੇ \nਫ਼ੌਜਾਂ ਅਕਾਲੀ ਨੇ, ਨਿਰਭਉ ਨੇ ਕਾਲ ਤੋਂ\nਕਿਸੇ ਮੂਹਰੇ ਝੁਕਦੀਆਂ ਨਹੀਂ, ਸਿਵਾਏ ਅਕਾਲ ਤੋਂ\nਹਾਲੇ ਤੱਕ ਕਿਸੇ ਤੋਂ ਵੀ ਰੁਕੀਆਂ ਨਹੀਂ ਝੁਕੀਆਂ ਨਹੀਂ \nਡਰੀਆਂ ਨਹੀਂ ਕੰਬੀਆਂ ਨਹੀਂ ਹੰਬੀਆਂ ਨਹੀਂ ਮੁੱਕੀਆਂ ਨਹੀਂ\nਦੌਰਾਂ ਨੇ ਜ਼ੋਰ ਲਾਇਆ ਸਿਰਾਂ ਦਾ ਮੋਲ ਪਾਇਆ\nਕੱਲੇ ਕੱਲੇ ਸਿਰ ਦਾ ਸਿੰਘਾਂ ਮੋਲ ਖੂਨ ਡੋਲ੍ਹ ਪਾਇਆ\nਛੰਬਾਂ ਚ ਪੱਤੇ ਉਬਾਲ ਕੇ ਖਾਧੇ\nਵੀਹਾਂ ਦੇ ਲੰਗਰ ਦੇ ਹੁੰਦੇ ਰਹੇ ਵਾਧੇ\nਢਾਲਾਂ ਦੇ ਤੀਰਾਂ ਦੇ ਸੈਫ਼ਾਂ ਦੇ ਚੇਲੇ\nਚੰਡੀ ਦੇ ਜਾਪੀ ਨੇ ਉਠਦੇ ਸੁਵੇਲੇ\nਖੰਡੇ ਚੋਂ ਉਪਜੇ ਬਾਟੇ ਦੇ ਹਾਣੀ\nਅਣਖੀ ਜੁਝਾਰੂ, ਇਨਕਲਾਬੀ ਕਹਾਣੀ\nਹਵਾ ਪੰਜਾਬ ਦੀ ਖਾਲਸ ਲਹੂ ਚੋਂ ਪਾਰ ਗਈ\nਚਿੜੀਆਂ ਤੋਂ ਬਾਜ਼ਾਂ ਨੂੰ ਟੁੱਟਦੇ ਹੋਏ ਦੇਖ ਕੇ\nਸਿੰਧ ਤੋਂ ਪਾਰ ਓਹੋ ਤਿੱਤਰਾਂ ਦੀ ਡਾਰ ਗਈ\nਮਾਤਾ ਸਾਹਿਬ ਦੇ ਪੁੱਤਰ ਵੱਸਦੇ ਹੀ ਰਹਿਣਗੇ \nਸੱਪ ਕੁੰਡਲੀਏ ਵਾਂਙੂ, ਵੈਰੀ ਨੂੰ ਡੱਸਦੇ ਹੀ ਰਹਿਣਗੇ \nਹੋਣੀ ਤੋਂ ਟਲਦੇ ਨਾ, ਸਿਰ ਹੱਥਾਂ ਤੇ ਰੱਖਦੇ ਨੇ\nਸੁਣ ਹਰਿਮੰਦਰ ਦੀ ਬੇਅਦਬੀ, ਲਹੂ ਲਾਵੇ ਆਂਗੂ ਭਖਦੇ ਨੇ\nਖੰਡੇ ਦੋਧਾਰੇ ਉੱਤੇ ਬੇਖੌਫ ਹੋ ਕੇ ਨੱਚਦੇ ਨੇ\nਕੂੜ ਦੇ ਵੈਰੀ ਨੇ ਸੱਜਣ ਸੱਚ ਦੇ ਨੇ\nਖ਼ਿਆਲਾਂ ਦੇ ਬਾਗ਼ੀ ਕਿੱਥੇ ਹਾਕਮਾਂ ਨੂੰ ਜੱਚਦੇ ਨੇ\nਇਹਨਾਂ ਦੇ ਬੋਲੇ ਵੈਰੀ ਕੰਬਾਉਂਦੇ ਨੇ\nਜੈਕਾਰੇ ਗਜਾ ਕੇ ਹਿਮਾਲਾ ਹਿਲਾਉਂਦੇ ਨੇ",
      slug: "singha-di-mehma",
      date: "2024-11-19T14:54:03.114Z",
      __v: 0,
    },
    {
      _id: "673ca6a89b3b66ac7d33ec9a",
      title: "Talje Banda",
      body: "ਟਿਕ ਟਿਕ ਟਿਕ ਟਿਕ ਸਦਾ ਨਹੀਂ ਰਹਿਣੀ\nਇਕ ਦਿਨ ਇਸ ਨੇ ਖੜ੍ਹਨਾ ਈ ਆ\nਨਿੱਤ ਦਿਨ ਮਰਨੋਂ ਟਲਜੇ ਬੰਦਾ\nਆਖਰ ਵੀ ਤਾਂ ਮਰਨਾ ਈ ਆ\n",
      slug: "talje-banda",
      date: "2024-11-19T14:54:32.959Z",
      __v: 0,
    },
    {
      _id: "673ca6b69b3b66ac7d33ec9c",
      title: "Azaadi",
      body: "ਦੱਸ ਖਾਂ ਏਹੇ ਕੈਸੀ ਅਜ਼ਾਦੀ ਐ \nਸਾਡੀ ਅੱਖ ਨਾਲ ਦੇਖ ਸਾਡੀ ਬਰਬਾਦੀ ਐ\nਟਾਂਵਾ ਟਾਂਵਾ ਮਿਲੇ ਜਾਗਦੀ ਜ਼ਮੀਰ ਦਾ\nਬਹੁਤੀ ਐਥੇ ਅੰਧ - ਭਗਤੀ ਆਬਾਦੀ ਐ\nਧਰਮ ਦੇ ਨਾਮ ਉੱਤੇ ਭਾਈ ਵੰਡੀ ਗਏ\nਦੇ ਕੇ ਲਾਲਚ ਅਜ਼ਾਦੀ ਦਾ, ਤਬਾਹੀ ਵੰਡੀ ਗਏ\nਹੁਣ ਵੀ ਤੂੰ ਦੇਖਲੈ ਸਿੰਘ ਬੰਦੀ ਪਏ ਨੇ\nਏਹੇ ਬਲਾਤਕਾਰੀਆਂ ਨੂੰ ਰਿਹਾਈ ਵੰਡੀ ਗਏ\nਸਾਡੇ ਹਿੱਸੇ ਆਏ ਸਿਵੇ ਨੌਜਵਾਨਾਂ ਦੇ\nਅੱਧਮਰੇ ਜਿਸਮ ਜੂਠੇ ਹੋਏ ਹੈਵਾਨਾਂ ਦੇ\nਤੁਸੀਂ ਬਹਿੰਦੇ ਜੱਚ ਕੇ ਮਹਾਰਾਜਿਆਂ ਵਾਂਙੂ\nਬਾਹਰੋਂ ਸੁੱਚੇ ਅੰਦਰੋਂ ਚੰਡੇ ਹੋਏ ਸ਼ੈਤਾਨਾਂ ਦੇ\n",
      slug: "azaadi",
      date: "2024-11-19T14:54:46.632Z",
      __v: 0,
    },
    {
      _id: "673ca6cc9b3b66ac7d33ec9e",
      title: "Lashkar - E - Gobind",
      body: "ਜੁਝਾਰੂ ਹੈਂ ਜਜ਼ਬੇ, ਲਸ਼ਕਰ ਏ ਗੋਬਿੰਦ ਕੇ\nਤਭੀ ਤੋ ੧੦ ਲਾਖ ਸੇ ਚਾਲੀਸ ਹੀ ਬਿੜ ਗਏ\nਖੰਜਰੋਂ ਸੇ ਨੇਜ਼ੋਂ ਕੋ ਮਾਤ ਹੈਂ ਦੇਤੇ \nਅਕਾਲ ਸਹਾਇ ਹੈ, ਚੰਡੀ ਕੋ ਪੜ੍ਹਤੇ",
      slug: "lashkar---e---gobind",
      date: "2024-11-19T14:55:08.647Z",
      __v: 0,
    },
    {
      _id: "673ca6dc9b3b66ac7d33eca0",
      title: "Kulwinder Kaur",
      body: "ਜਿੰਨਾ ਦੀਆਂ ਮਾਵਾਂ ਬਾਰੇ ਮਾੜਾ ਬੋਲਿਆ\nਪਤਾ ਚਲਿਆ ਹੋਊ ਹੱਥਾਂ ਵਿੱਚ ਭਰੇ ਜ਼ੋਰ ਦਾ\nਸਰਬ ਲੋਹ ਦੇ ਮੂਹਰੇ ਕੰਗਨੇ ਟੁੱਟੇ\nਜਦੋਂ ਹੱਥ ਉਠਿਆ ਹੋਊ ਕੁਲਵਿੰਦਰ ਕੌਰ ਦਾ",
      slug: "kulwinder-kaur",
      date: "2024-11-19T14:55:24.356Z",
      __v: 0,
    },
    {
      _id: "673ca71b9b3b66ac7d33eca2",
      title: "Sant Jarnail Singh Ji Bhindrawale",
      body: "ਤੂੰ ਓਸ ਤਖ਼ਤ ਤੇ ਟੈਂਕ ਚਾੜਤੇ,\nਜਿਹਨੂੰ ਕਹਿੰਦੇ ਤਖ਼ਤ ਅਕਾਲ ਦਾ ਏ,\nਤਖ਼ਤ ਦੀ ਆਨ ਲਈ ਬੈਠਾ ਜਿਹੜਾ,\nਮੁਖੀ ਦਮਦਮੀ ਟਕਸਾਲ ਦਾ ਏ,\nਓਹਨੇ ਹੱਥ ਵਿਚ ਫੜਿਆ ਤੀਰ ਹੁੰਦਾ,\nਗਲ ਪਿਸਟਲ ਨਾਲੇ ਰੌਂਦ ਦਿਖੇ, \nਕਹਿਣ ਕਰਨ ਦਾ ਪੂਰਾ ਸੀ, \nਓਹਦੀ ਗੱਲ ਚ ਸਿੱਖੀ ਦੀ ਹੋਂਦ ਦਿਖੇ ।",
      slug: "sant-jarnail-singh-ji-bhindrawale",
      date: "2024-11-19T14:56:27.646Z",
      __v: 0,
    },
    {
      _id: "673ca7289b3b66ac7d33eca4",
      title: "Yaari",
      body: "ਮੁੱਢ ਤੋਂ ਹੀ ਬਣੀ ਨਹੀਂ, ਧੋਖਿਆਂ ਤੇ ਖਾਰਾਂ ਨਾਲ\nਇੱਕੋ ਯਾਰ ਮੇਰਾ, ਰੱਬ ਵਰਗਾ ਸਹਾਰਾ ਨਾਲ\nਕਾਵਾਂ ਵਾਂਙੂ ਰੱਖੇ ਨਾ ਯਾਰਾਨੇ ਮੈਂ ਮੀਨਾਰਾਂ ਨਾਲ\nਬਾਜ਼ਾਂ ਦਾ ਕੀ ਮੇਲ ਦੱਸ ਘੁੱਗੀਆਂ ਕਟਾਰਾਂ ਨਾਲ",
      slug: "yaari",
      date: "2024-11-19T14:56:40.324Z",
      __v: 0,
    },
    {
      _id: "673ca7429b3b66ac7d33eca6",
      title: "Patshahi Daawa",
      body: "ਚੰਡੀ ਜਿਵੇਂ ਰੱਤ ਦੀ ਤਿਹਾਈ ਵਰਗੇ\nਜ਼ਫ਼ਰਨਾਮੇ ਦੀ ਆ ਸਿਆਹੀ ਵਰਗੇ\nਹੋਵੇਗੀਂ ਨਵਾਬੀ ਘਰ ਖ਼ਾਨ ਦੇ ਹੋਵੇਗੀਂ\nਗੌਰ ਨਾਲ ਦੇਖ ਪਾਤਸ਼ਾਹੀ ਵਰਗੇ",
      slug: "patshahi-daawa",
      date: "2024-11-19T14:57:06.103Z",
      __v: 0,
    },
    {
      _id: "673ca74f9b3b66ac7d33eca8",
      title: "Rani Tatt",
      body: "ਰਾਣੀ ਤੱਤ ਪੜ੍ਹ ਕੇ ਜਵਾਨ ਹੋਏ ਗੱਭਰੂ\nਸਿਖ਼ਰ ਦੁਪਿਹਰੋਂ ਠੰਡੀ ਸ਼ਾਮ ਹੋਏ ਗੱਭਰੂ\nਕਰਜ਼ਾ ਬਾਪੂ ਨੇ ਲੈ ਕੇ ਚਾੜ੍ਹਿਆ ਜਹਾਜੇ ਜਿਹੜਾ\nਲਾ 18 ਘੰਟੇ ਸ਼ਿਫਟਾਂ ਉਹ ਲਾਹਣ ਆਏ ਗੱਭਰੂ",
      slug: "rani-tatt",
      date: "2024-11-19T14:57:19.305Z",
      __v: 0,
    },
    {
      _id: "673ca76b9b3b66ac7d33ecaa",
      title: "Motivational",
      body: "ਰਾਹਾਂ ਦੇ ਰੋੜੇ ਆਂ ਹਿੱਕਾਂ 'ਚ ਵੱਜਾਂਗੇ ।\nਹਰਾਉਣੇ ਲਈ ਕਿਸਮਤ ਨੂੰ ਜੰਗਾ ਲਈ ਸੱਜਾਂਗੇ ।\nਫਤਹਿ ਕਰ ਜੰਗਾਂ  ਤੇ ਵੱਸ ਕਰਕੇ ਲੇਖਾਂ ਨੂੰ ।\nਨਾ ਹੁਣ ਸਬਰਾਂ ਦਾ ਘੁੱਟ ਪੀ ਕੇ ਰੱਜਾਂਗੇ ।",
      slug: "motivational",
      date: "2024-11-19T14:57:47.606Z",
      __v: 0,
    },
    {
      _id: "673ca7bd9b3b66ac7d33ecae",
      title: "Guru Hargobind Sahib Ji",
      body: "ਅਸੀਂ ਬੰਦੀ ਸਾਂ, ਤੂੰ ਬੰਦੀ ਛੋੜ ਦਾਤਾ \nਤਾਂ ਹੀ ਬੰਦੀਆਂ ਦੇ ਕੋਲ ਪੁੱਜਿਆ ਤੂੰ\nਤੇਰੇ ਨੈਣ ਸੋਹਣੇ ਤੇਰਾ ਰੂਪ ਸੋਹਣਾ\nਨੂਰ ਚੇਹਰੇ ਦਾ ਦੱਸੇ ਕੋਈ ਪੁੱਜਿਆ ਤੂੰ\nਸਾਡੇ ਕੋਲ ਬਹਿਕੇ ਜਿਹੜੇ ਦੀਵਾਨ ਲਾਏ\nਦੀਵਾ ਆਸਾਂ ਦਾ ਬੁੱਝਿਆ ਸੀ ਬਾਲਿਆ ਤੂੰ\nਰੱਬ ਨਾਲ ਬਹਿਕੇ ਰੱਬ ਪੂਜਦੇ ਸੀ\nਪਏ ਖੋਲਦੇ ਸਾਂ ਜਿੰਦਗੀ ਦੇ ਤਾਲਿਆਂ ਨੂੰ \nਤੇਰੇ ਸਿੱਖ ਆਉਂਦੇ ਲੈ ਕੇ ਚੌਂਕੀਆਂ ਨੂੰ\nਕਰ ਪਰਿਕ੍ਰਮਾ , ਲੇਖੇ ਲਾ ਸਵਾਸ ਮੁੜਦੇ\nਹੱਥ ਮਾਲਾ ਤੇਰੇ ਤਲਵਾਰਾਂ ਦੋ ਬੱਧੀਆਂ\nਸਾਡੇ ਦਿਲ ਚ ਕਈ ਨੇ ਸਵਾਲ ਤੁਰਦੇ\n52 ਕਲੀਆਂ ਵਾਲਾ ਚੋਲਾ ਪਾਇਆ ਜਿਹੜਾ\nਏਹ ਸਾਨੂੰ ਰਿਹਾਅ ਕਰਵਾਉਣ ਦੇ ਲਈ\nਅਸੀ ਜਾਨ ਵੀ ਦੇਈਏ ਤਾਂ ਵੀ ਕੋਈ ਮੁੱਲ ਨਹੀਂ\nਏਸ ਜਾਨ ਦਾ ਕਰਜ਼ਾ ਲਾਹੁਣ ਦੇ ਲਈ",
      slug: "guru-hargobind-sahib-ji",
      date: "2024-11-19T14:59:09.881Z",
      __v: 0,
    },
    {
      _id: "673caff4e72a62740f1bb73d",
      title: "Singh",
      body: "ਜਦ ਪੈਂਦੀ ਚੋਟ ਨਗਾਰਿਆਂ ਤੇ\nਸਿੰਘ ਹੱਥ ਪਾਉਂਦੇ ਸ਼ਮਸ਼ੀਰਾਂ ਨੂੰ\nਤੀਰਾਂ ਨੂੰ ਤੰਦੀ ਚਾੜ੍ਹ ਕੇ ਛੱਡਦੇ \nਜੋ ਚੀਰਦੇ ਜਾਂਦੇ ਭੀੜਾਂ ਨੂੰ\nਨੇਜਿਆਂ ਤੇ ਮੱਸੇ ਰੰਗੜ ਦਾ\nਆਪਣਾ ਤਲੀ ਟਿਕਾਉਂਦੇ ਨੇ\nਏਹ ਭੀੜ ਬਣੀ ਤੇ ਮੂਹਰੇ ਹੋ\nਨਾਂ ਧਰਮ ਦੇ ਲਾਉਣ ਸ਼ਰੀਰਾਂ ਨੂੰ",
      slug: "singh",
      date: "2024-11-19T15:34:12.854Z",
      __v: 0,
    },
    {
      _id: "673e0f8545eecbf0495b64ae",
      title: "ਭਰਵਾਸੇ",
      body: "ਫਿਕਰਾਂ ਨੂੰ ਪਾਸੇ ਰੱਖ\nਚਿਹਰੇ ਉੱਤੇ ਹਾਸੇ ਰੱਖ\nਓਹਨੇ ਕਰਨਾ, ਚੰਗਾ ਕਰੂਗਾ\nਓਹਦੇ ਤੇ ਭਰਵਾਸੇ ਰੱਖ",
      slug: "ਭਰਵਾਸੇ",
      date: "2024-11-20T16:34:13.758Z",
      __v: 0,
    },
  ]);
  useEffect(() => {
    fetch("https://back-2qdp.onrender.com/poems")
      .then((response) => response.json())
      .then((data) => setPoems(data))
      .catch((error) => console.error(error));
  }, []);

  return (
    <div className="">
      <div className="w-full p-3 md:w-4/5 m-auto md:grid md:grid-cols-2 md:gap-3">
        {poems ? (
          <>
            {poems.map((poem) => (
              <Link href={`/${poem.slug}`} key={poem._id}>
                <div
                  className="
            title-block
              shadow-xl
              p-4
              text-2xl
              my-4
              transition-all
              cursor-pointer
            "
                >
                  <h2>{poem.title}</h2>
                </div>
              </Link>
            ))}
          </>
        ) : (
          <>
            {oldPoems.map((poem) => (
              <Link href={`/${poem.slug}`} key={poem._id}>
                <div
                  className="
            title-block
            shadow-xl
            p-4
            text-2xl
            my-4
            transition-all
            cursor-pointer
            "
                >
                  <h2>{poem.title}</h2>
                </div>
              </Link>
            ))}
          </>
        )}
      </div>
    </div>
  );
};

export default Page;
